---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowLeftRunBoundary2d
source: html/f2ba514a-0859-d029-54a5-687fed673ac6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowLeftRunBoundary2d Property

"Show Run's Left Boundary 2D"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsDbgShowLeftRunBoundary2d { get; }
```